SESC_JSON = {
    "weekdays": {
        "Понедельник": "1",
        "Вторник": "2",
        "Среда": "3",
        "Четверг": "4",
        "Пятница": "5",
        "Суббота": "6"
    },
    "weekdays_inverted": {
        "1": "понедельник",
        "2": "вторник",
        "3": "среду",
        "4": "четверг",
        "5": "пятницу",
        "6": "субботу"
    },
    
    # lycreg
    "scole_domain": "https://lycreg.urfu.ru/",
    "full_marks": {
        "0": "н/а",
        "2": "2 (неуд.)",
        "3": "3 (удовл.)",
        "4": "4 (хор.)",
        "5": "5 (отл.)",
        "999": "зач.",
    },
    "weights": ['0', '0.5', '', '1.5', '2.0', '2.5', '3.0', '3.5', '4.0'],
    "weight_nums": [0, 0.5, 1, 1.5, 2, 2.5, 3, 3.5, 4],
    "dtsit": {
        "d205a": ["1ч", "Первая четверть", "d001", "d205"],
        "d331b": ["2ч", "Вторая четверть", "d206", "d331"],
        "d628d": ["3ч", "Третья четверть", "d401", "d628"],
        "d915e": ["4ч", "Четвертая четверть", "d629", "d915"],
    },
    "add_dtsit": {
        "d331c": ["1п", "Первое полугодие", "d001", "d331"],
        "d915f": ["2п", "Второе полугодие", "d401", "d915"],
        "d925g": ["Год", "Учебный год", "d001", "d925"],
    },
    "default_subjects": {
        "s110": "Русский язык",
        "s120": "Литература",
        "s210": "Английский язык",
        "s220": "Немецкий язык",
        "s230": "Французский язык",
        "s310": "Искусство",
        "s320": "МХК",
        "s330": "Музыка",
        "s410": "Математика",
        "s420": "Алгебра",
        "s430": "Алгебра и начала анализа",
        "s440": "Геометрия",
        "s450": "Информатика",
        "s510": "История",
        "s520": "История России",
        "s530": "Всеобщая история",
        "s540": "Обществознание",
        "s550": "Экономика",
        "s560": "Право",
        "s570": "География",
        "s610": "Физика",
        "s620": "Астрономия",
        "s630": "Химия",
        "s640": "Биология",
        "s710": "Технология",
        "s810": "Физическая культура",
        "s820": "ОБЖ",
    },
}

SESC_JSON["all_dtsit"] = SESC_JSON["dtsit"] | SESC_JSON["add_dtsit"]
